XPavel86/ESp32UniversalRele/Settings.h
    Serial.printf("Received Relay: %s, Action: %s\n", relay.c_str(), action.c_str());

    bool relayFound = false;

    for (auto& r : control.relays) {
      if (r.description == relay) {
        relayFound = true;
        r.statePin = (action == "on");
      
        Serial.printf("Setting Relay Pin %d to %s\n", r.pin, r.statePin ? "HIGH" : "LOW");
        r.manualMode = true;
        digitalWrite(r.pin, r.statePin ? HIGH : LOW);
        isSaveControl = true;
        request->send(200, "text/plain", "Command executed");
        break;
      }
    }

    if (!relayFound) {
      request->send(404, "text/plain", "Relay not found");
    }
  });

  server.on("/resetManual", HTTP_POST, [](AsyncWebServerRequest* request) {
    Serial.println("Resetting all relays to Auto mode");

    bool anyRelayUpdated = false;

    for (auto& r : control.relays) {
      if (r.manualMode) {
        r.manualMode = false;  // Устанавливаем режим в Auto
        r.statePin = false;
        digitalWrite(r.pin, LOW);
        anyRelayUpdated = true;

        Serial.printf("Relay %s set to Auto mode\n", r.description.c_str());
      }
    }

    if (anyRelayUpdated) {
      isSaveControl = true;
      request->send(200, "text/plain", "All relays reset to Auto");
    } else {
      request->send(200, "text/plain", "No relays to reset");
    }
  });

  server.on("/relayStates", HTTP_GET, [](AsyncWebServerRequest* request) {
    String json = "{";
    json += "\"relays\":[";
    for (const auto& relay : control.relays) {
        json += "{";
        json += "\"description\":\"" + relay.description + "\",";
        json += "\"state\":" + String(digitalRead(relay.pin) ? "true" : "false") + ",";
        json += "\"mode\":\"" + String(relay.manualMode ? "Manual" : "Auto") + "\"";
        json += "},";
    }
    if (!control.relays.empty()) {
        json.remove(json.length() - 1);  // Удалить последнюю запятую
    }
    json += "],";
    json += "\"temp\":" + String(Temp);
    json += "}";
    request->send(200, "application/json", json);
    
    //Serial.println(json);
});

//========= настройки control
server.on("/getRelaySettings", HTTP_GET, [](AsyncWebServerRequest *request) {
    // Создаем список доступных пинов
    std::vector<int> availablePins = control.pins;

    // Формируем JSON-ответ
    String response = "{";
    response += "\"relays\":[";

    bool firstRelay = true;
    for (const auto &relay : control.relays) {
        // Проверяем, что у реле есть описание
        if (!relay.description.isEmpty()) {
            if (!firstRelay) {
                response += ","; // Добавляем запятую между объектами
            } else {
                firstRelay = false;
            }
            
            Serial.print("load relay.statePin: ");
            Serial.println(relay.modePin); // Логируем значение modePin
            
            // Формируем объект для текущего реле
            response += "{";
            response += "\"pin\":" + String(relay.pin) + ",";
            response += "\"modePin\":\"" + relay.modePin + "\",";
            response += "\"manualMode\":" + String(relay.manualMode ? "true" : "false") + ",";
            response += "\"statePin\":" + String(relay.statePin ? "true" : "false") + ",";
            response += "\"description\":\"" + relay.description + "\"";
            response += "}";
        }
    }
    response += "],";

    // Добавляем список доступных пинов
    response += "\"availablePins\":[";
    for (size_t i = 0; i < availablePins.size(); ++i) {
        response += String(availablePins[i]);
        if (i < availablePins.size() - 1) {
            response += ",";
        }
    }
    response += "]";

    response += "}";

    // Отправляем ответ клиенту
    request->send(200, "application/json", response);
});

// Обработчик для сохранения настроек реле
server.on("/saveRelaySettings", HTTP_POST, [](AsyncWebServerRequest* request) {
    Serial.println("Received POST request to /saveRelaySettings");

    printRequestParameters(request) ;

    String requestBody;
    if (request->hasParam("relaySettings", true)) {
        requestBody = request->getParam("relaySettings", true)->value();
        Serial.println(requestBody);
    } else {
        Serial.println(requestBody);
        request->send(400, "application/json", "{\"error\":\"Missing relaySettings parameter\"}");
        return;
    }

    // Обработка тела запроса
    DynamicJsonDocument doc(2048); // Увеличьте размер, если необходимо
    DeserializationError error = deserializeJson(doc, requestBody);

    if (error) {
        Serial.print(F("deserializeJson() failed: "));
        Serial.println(error.f_str());
        request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
        return;
    }

    // Проверка, является ли JSON массивом
    if (!doc.is<JsonArray>()) {
        Serial.println(F("Invalid JSON: Expected an array"));
        request->send(400, "application/json", "{\"error\":\"Expected a JSON array\"}");
        return;
    }

    JsonArray relays = doc.as<JsonArray>();
    control.relays.clear(); // Очищаем существующий массив реле

    for (JsonVariant v : relays) {
        if (!v.is<JsonObject>()) {
            Serial.println(F("Invalid JSON object in array"));
            request->send(400, "application/json", "{\"error\":\"Invalid JSON structure\"}");
            return;
        }

        Relay relay;
        JsonObject relayObj = v.as<JsonObject>();

        // Заполняем данные реле с проверкой
        relay.pin = relayObj.containsKey("pin") ? relayObj["pin"].as<int>() : 5;
        relay.modePin = relayObj.containsKey("modePin") ? relayObj["modePin"].as<String>() : "OUTPUT";
        relay.manualMode = relayObj.containsKey("manualMode") ? relayObj["manualMode"].as<bool>() : false;
        relay.statePin = relayObj.containsKey("statePin") ? relayObj["statePin"].as<bool>() : false;
        relay.description = relayObj.containsKey("description") ? relayObj["description"].as<String>() : "Relay_1";

        control.relays.push_back(relay);

        // Вывод информации о реле в консоль
        Serial.printf("Relay added: Pin=%d, Mode=%s, ManualMode=%d, StatePin=%d, Description=%s\n",
                      relay.pin, relay.modePin.c_str(), relay.manualMode, relay.statePin, relay.description.c_str());
    }

    request->send(200, "application/json", "{\"status\":\"Success\"}");
});

// Обработчик для добавления нового реле
server.on("/addRelay", HTTP_POST, [](AsyncWebServerRequest* request) {
    Serial.println("Received POST request to /addRelay");
    printRequestParameters(request);
     // Проставляем значения по умолчанию
    String pin = request->hasParam("pin", true) ? request->getParam("pin", true)->value() : "";
    String modePin = request->hasParam("modePin", true) ? request->getParam("modePin", true)->value() : "OUTPUT";
    String manualMode = request->hasParam("manualMode", true) ? request->getParam("manualMode", true)->value() : "false";
    String statePin = request->hasParam("statePin", true) ? request->getParam("statePin", true)->value() : "false";
    String description = request->hasParam("description", true) ? request->getParam("description", true)->value() : "Relay_1";

   // Проверяем, что все необходимые параметры присутствуют
    if (pin.isEmpty() || modePin.isEmpty()) {
        request->send(400, "application/json", "{\"error\":\"Missing required fields\"}");
        return;
    }

