XPavel86/ESp32UniversalRele/Settings.h
void updateStatus() {
  if (previousStatus != statusUpdate) {
    bot->sendMessage(CHAT_ID, statusUpdate, "");
    previousStatus = statusUpdate;
  }
}

//==================================
void sendMessageWithMarkdown(String chat_id, String message) {
  // Создаем JSON-объект
  DynamicJsonDocument doc(1024);
  JsonObject payload = doc.to<JsonObject>();

  // Заполняем JSON-объект
  payload["chat_id"] = chat_id;
  payload["text"] = message;
  payload["disable_web_page_preview"] = true;  // Отключаем предварительный просмотр
  payload["parse_mode"] = "Markdown";          // Указываем использование Markdown "HTML"

  // Отправляем сообщение
  bool result = bot->sendPostMessage(payload, false);  // false означает, что не требуется редактирование сообщения
}

//==================================

bool isValidTokenFormat(const String& token) {
  int colonIndex = token.indexOf(':');

  if (colonIndex == -1 || colonIndex == 0 || colonIndex == token.length() - 1) {
    return false;
  }

  String userIdPart = token.substring(0, colonIndex);
  for (int i = 0; i < userIdPart.length(); i++) {
    if (!isDigit(userIdPart[i])) {
      return false;
    }
  }

  String secretPart = token.substring(colonIndex + 1);
  if (secretPart.length() < 20) {
    return false;
  }

  return true;
}

//==================================

File sendFileToTg;

bool isMoreDataAvailable() {
  return sendFileToTg.available();
}

byte getNextByte() {
  return sendFileToTg.read();
}


//================================
bool handleTelegramCommand(String chat_id, String command) {
  command.trim();  // Удалить лишние пробелы в начале и конце строки

  // Проверка и обработка команды "/on" и "/off"
  if (command.startsWith("/on") || command.startsWith("/off")) {
    bool turnOn = command.startsWith("/on");
    int relayNumber = command.substring(turnOn ? 3 : 4).toInt();  // Извлечь номер реле

    // Проверка, что relayNumber в диапазоне 1-4
    if (relayNumber >= 1 && relayNumber <= control.relays.size()) {
      int relayIndex = relayNumber - 1;
      auto& r = control.relays[relayIndex];
      r.statePin = turnOn;
      r.manualMode = true;
      digitalWrite(r.pin, turnOn ? HIGH : LOW);
      Serial.printf("Relay %d turned %s\n", r.pin, turnOn ? "ON" : "OFF");
      isSaveControl = true;  // Сохраняем состояние после изменения
      return true;
    } else {
      Serial.println("Invalid relay number");
      bot->sendMessage(chat_id, "Invalid relay number", "");
      return false;
    }
  }
  // Проверка команды "/statusControl" 
  else if (command == "/status") {
    String sOut = sendStatus();
    bot->sendMessage(chat_id, sOut, "");
    return true;
  }

  // Проверка команды "/resetManual"
  else if (command == "/resetManual") {
    String sOut;
    bool anyRelayUpdated;
    
    for (auto& r : control.relays) {
      if (r.manualMode) {
        r.manualMode = false;  // Устанавливаем режим в Auto
        r.statePin = false;
        digitalWrite(r.pin, LOW);
        anyRelayUpdated = true;

        sOut += r.description + String(" set to Auto mode\n");
      }
    }
    if (anyRelayUpdated) {
      isSaveControl = true;  // Сохраняем состояние после изменения

      bot->sendMessage(chat_id, sOut, "");
      Serial.print(sOut);
    }
    return true;
  }
  // Проверка и обработка команды "/setLimitWorkPressurePump"
//  else if (command.startsWith("/setLimitWorkPressurePump")) {
//    int value = command.substring(25).toInt();  // Извлечь значение
//    control.limitWorkPressurePump = value;
//    Serial.printf("limitWorkPressurePump set to %d\n", value);
//    isSaveControl = true;
//    return true;
//  }
  //===============
  
   else if (command.startsWith("/help")) {
    bool value = command.substring(5).equalsIgnoreCase("true");  // Извлечь значение
    String res = sendHelp();
    bot->sendMessage(chat_id, res, "");
    return true;
  } else if (command.startsWith("/resetFull")) {
    bool value = command.substring(10).equalsIgnoreCase("true");  // Извлечь значение
    initializeControl();
    bot->sendMessage(chat_id, "Все параметры сброшены по умолчанию", "");
    isSaveControl = true;
    return true;
  } else if (command.startsWith("/debug")) {
    bool value = command.substring(6).equalsIgnoreCase("true");  // Извлечь значение
    String outStr = debugInfo();
    bot->sendMessage(chat_id, outStr, "");

    return true;
  } else if (command.startsWith("/log")) {
    bool value = command.substring(4).equalsIgnoreCase("true");  // Извлечь значение
    String outStr = getLog();
    bot->sendMessage(chat_id, outStr, "");

    return true;
  }
  // Неизвестная команда
  else {
    Serial.println("Unknown command. Please use /help for help.");
    return false;
  }
}


//=================================

void handleNewMessages(int numNewMessages) {
  delay(10);
  //Serial.println(String(numNewMessages));

  for (int i = 0; i < numNewMessages; i++) {

    // Идентификатор чата запроса
    String chat_id = String(bot->messages[i].chat_id);
    CHAT_ID = chat_id;

    int message_id = bot->messages[i].message_id;
    String text = bot->messages[i].text;

    if (text.length() > 512) {
      bot->sendMessage(chat_id, "Ваше сообщение слишком длинное и было проигнорировано.", "");
      continue;
    }

    const TelegramUserID* user = getUserById(chat_id);
    if (user == nullptr) {
      bot->sendMessage(chat_id, "Access is denied, user does not exist", "");
      continue;
    }


    // Проверка доступа на чтение и запись
    if (!user->reading) {
      bot->sendMessage(chat_id, "Read access denied", "");
      continue;
    }

    if (!user->writing) {
      bot->sendMessage(chat_id, "Write access denied", "");
      continue;
    }

    Serial.println(text);

    //======КНОПКИ====
    if (handleTelegramCommand(chat_id, text)) {
    } else

      if (text == "/statusSystem") {
      bot->sendMessage(chat_id, getSystemStatus(), "");
    } else

      if (text == "/start") {
      bot->sendMessage(chat_id, "Hello", "");
    } else

