XPavel86/ESp32UniversalRele/Settings.h
      if (text == "/reset") {
      bot->sendMessage(chat_id, "Перезагрузка", "");
      delay(1000);
      res = true;
      delay(500);
    } else

      if (text == "/update") {
      isUpdate = true;

      String message = "Выберете файл прошивки .bin, контента .html или настроек .json📎. [Скачать прошивку](https://cloud.mail.ru/public/KtJ5/WgxbfXTrP)";
      sendMessageWithMarkdown(chat_id, message);

    } else if (isUpdate) {

      size_t file_size = bot->messages[i].file_size;
      String file_path = bot->messages[i].file_path;
      String file_name = bot->messages[i].file_name;

      size_t totalBytes = SPIFFS.totalBytes();
      size_t usedBytes = SPIFFS.usedBytes();
      size_t freeBytes = totalBytes - usedBytes;

      //      Serial.println(file_path);
      //      Serial.println(file_name);
      //      Serial.println(file_size);

      String extension = file_name.substring(file_name.lastIndexOf('.') + 1);

      bool sizeOk = freeBytes > file_size || extension == "bin";
      if (!sizeOk) {
        bot->sendMessage(chat_id, "Превышен размер файла. Свободно: " + String(freeBytes / 1024) + " KB. Размер файла: " + String(file_size / 1024) + " KB.", "");
      }

      if (sizeOk && file_size > 0 && file_path.length() > 10) {

        bot->sendMessage(chat_id, "Файл принят: " + file_name, "");

        if (extension == "bin") {
          file_name = "firmware.bin";  // Переименовываем файл так как длинные имена и с подчеркиванием все ломают
        }

        TaskParameters* params = new TaskParameters;
        params->filePath = file_path;  // Передаем путь к файлу
        params->fileName = file_name;  // Передаем имя файла

        delay(200);

        BaseType_t resultOta = xTaskCreate(
          otaUpdateTask,  // Функция задачи
          "OTA Update",   // Имя задачи
          8192,           // Размер стека
          params,         // Параметры задачи
          1,              // Приоритет
          NULL            // Дескриптор задачи
        );

        if (resultOta != pdPASS) {
          Serial.println("Failed to create OTA update task.");
          isUpdate = false;
          bot->sendMessage(chat_id, "Повторите попытку", "");
        }

        return;
      }
      //isUpdate = false;  // Сброс флага обновления перенесен в otaUpdateTask

    } else

      if (text == "/newtoken") {
      isNewToken = true;
      bot->sendMessage(chat_id, "Отправьте новый токен бота. Для создания бота: @BotFather", "");

    } else

      // не работает пока
      if (text.startsWith("/sendfile ")) {
        String fileNameSend = text.substring(10);
        String filePath = "/" + fileNameSend;

        sendFileToTg = SPIFFS.open(filePath, FILE_READ);
        if (!sendFileToTg) {
          Serial.println("Не удалось открыть файл для чтения");
          return;
        }

        String response = bot->sendMultipartFormDataToTelegram("sendDocument", "document", sendFileToTg.name(), "txt", chat_id, sendFileToTg.size(), isMoreDataAvailable, getNextByte, nullptr, nullptr);

        Serial.println("Ответ сервера: " + response);
        sendFileToTg.close();

      }

      else if (isNewToken) {
        text.trim();
        String botName = checkNewToken(text);
        bool isCheck = (botName != "") && isValidTokenFormat(text);

        if (isCheck) {
          String outStr = "Новый токен успешно применен, перейдите в новый телеграм бот: " + String("@") + botName;
          bot->sendMessage(chat_id, outStr, "");

          bot->updateToken(text);
          settings.telegramSettings.botId = text;

          saveSettings();

        } else {
          bot->sendMessage(chat_id, "Введеный токен не корректный или бот не существует", "");
        }

        isNewToken = false;
      } else

        if (text == "/format") {
        bot->sendMessage(chat_id, "Форматирование файловой системы", "");
        SPIFFS.format();
      } else

        if (text == "/list") {
        String listF = "Список файлов:\n";
        listF += listFiles();

        bot->sendMessage(chat_id, listF, "");
      } else if (text == "/networks") {
        String result = parseNetworkSettings(settings);
        bot->sendMessage(chat_id, result, "");
      }

    //=== END КНОПКИ =====//
    //return;
  }
  // return;
}
//==================

// Задача тиктака

void tikTak() {

  //if (!isUpdate) checkMemory();

  controlTask();

  if ((!settings.isAP || !isStartedAP) && settings.isWifiTurnedOn && !isUpdate) {
    tiktak1++;
  } else {
    tiktak1 = 0;
  }

  if (!isConnectionAttempts) {
    tiktak2++;
  } else {
    tiktak2 = 0;
  }

  if (settings.isWifiTurnedOn && !isStartedAP && WiFi.status() == WL_DISCONNECTED && isConnectionAttempts) {
    tiktak3++;
  } else {
    tiktak3 = 0;
  }
}
